{
    "@metadata": {
        "authors": [
            "Digital Research Alliance of Canada <support@frdr.ca> (https://www.frdr-dfdr.ca)"
        ],
        "last-updated": "2024-09-06",
        "locale": "fr"
    },
    "app-cancel-btn": "Cancel",
    "app-decrypt-button": "Decrypt Data",
    "app-decrypt-confirm": "You are attempting to decrypt the dataset $1. \n\nPlease only proceed if you are using a secure and trusted computer approved by your institution.\n\nDo you want to continue?",
    "app-decrypt-confirm-btn1": "Yes",
    "app-decrypt-confirm-btn2": "Cancel",
    "app-decrypt-desc": "Pour déchiffrer un ensemble de données chiffrées téléchargé depuis DFDR, vous devez copier-coller l'URL de la clé de vault figurant dans le courriel d'approbation de votre demande d'accès.",
    "app-decrypt-done": "Dataset has been decrypted.",
    "app-decrypt-error": "Error decrypting. $1",
    "app-decrypt-in-progress": "Decrypting dataset...",
    "app-decrypt-input": "Chemin d'accès à l'ensemble chiffré",
    "app-decrypt-input-missing": "Please select the encrypted package you want to decrypt. This is the encrypted data package you downloaded from FRDR.",
    "app-decrypt-input-select": "Select File",
    "app-decrypt-input-tooltip": "Sélectionnez ensuite l'ensemble chiffré que vous souhaitez déchiffrer.",
    "app-decrypt-no-selection": "No Selection",
    "app-decrypt-output": "Dossier de sortie",
    "app-decrypt-output-missing": "Please select a location for the decrypted dataset.",
    "app-decrypt-output-select": "Sélectionnez le répertoire",
    "app-decrypt-output-tooltip": "Veuillez vous assurer que l'emplacement sélectionné est sécurisé et adapté au stockage de fichiers à usage restreint.",
    "app-decrypt-selected": "Selected: $1",
    "app-decrypt-title": "Déchiffrer l'ensemble de données",
    "app-decrypt-url": "URL de la clé de vault",
    "app-decrypt-url-missing": "Please add the Vault Key URL, which is available in the email you received approving your access request.",
    "app-desc": "Bienvenue dans l'application de chiffrement du DFDR. Vous pouvez utiliser l'application pour crypter, déchiffrer et partager l'accès à des ensembles de données sensibles avec Le Dépôt fédéré de données de recherche.",
    "app-desc-homepage": "Bienvenue dans l'application de chiffrement du DFDR. Veuillez sélectionner l'une des options du menu ci-dessus pour commencer. <br><br>Si vous devez déposer des données à usage restreint dans DFDR, cliquez sur « Chiffrer l'ensemble de données » puis suivez les étapes pour créer un paquet de données chiffrées à déposer. Une fois votre ensemble de données publié, vous pouvez gérer les personnes ayant accès à vos fichiers à l'aide de l'option « Accorder l'accès » ci-dessus. <br><br>Si vous avez demandé l'autorisation d'accéder à des fichiers de données à usage restreint dans DFDR et que votre demande a été approuvée, cliquez sur « dechiffrer l'ensemble de données » et suivez les étapes pour extraire le contenu du paquet de données chiffrées que vous avez téléchargé depuis DFDR.",
    "app-encrypt-button": "Encrypt Data",
    "app-encrypt-cancel-button": "Stop Encryption",
    "app-encrypt-cancel-error": "Stopping encryption failed. $1",
    "app-encrypt-confirm": "After you encrypt your dataset you CANNOT add or change files. Please ensure the dataset is COMPLETE before you encrypt the dataset.",
    "app-encrypt-confirm-btn1": "Encrypt",
    "app-encrypt-confirm-btn2": "Cancel",
    "app-encrypt-done": "Your encrypted data package has been created at $1",
    "app-encrypt-done-text1": "Your dataset has been encrypted. Please continue to FRDR to upload the encrypted data package in your deposit. It must be added to the “sensitive” directory on the “Transfer Data” tab of the submission interface.",
    "app-encrypt-done-text2": "FRDR Publication Dashboard",
    "app-encrypt-done-title": "Encryption complete",
    "app-encrypt-error": "Error encrypting. $1",
    "app-encrypt-in-progress": "Encrypting dataset...",
    "app-encrypt-info": "Pour déposer des données à accès restreint sur DFDR, vous devez donc créer un paquet crypté. Chaque dépôt ne peut contenir qu'un seul paquet crypté. Placez les fichiers que vous souhaitez déposer dans un dossier de niveau supérieur et assurez-vous qu'ils ne sont pas compressés (c'est-à-dire qu'il ne s'agit pas de fichiers .zip ou .gz).",
    "app-encrypt-input": "Dossier de l'ensamble des données",
    "app-encrypt-input-missing": "Veuillez sélectionner le répertoire contenant l'ensemble de données que vous souhaitez chiffrer.",
    "app-encrypt-input-select": "Sélectionnez le répertoire",
    "app-encrypt-input-tooltip": "Sélectionnez le dossier de niveau supérieur qui contient le ou les fichiers de données que vous souhaitez chiffrer.",
    "app-encrypt-output": "Dossier de sortie",
    "app-encrypt-output-missing": "Please select the output location for your encrypted package.",
    "app-encrypt-output-select": "Sélectionnez le répertoire",
    "app-encrypt-output-tooltip": "Choisissez un emplacement sur votre ordinateur local ou votre serveur pour enregistrer le paquet de données chiffrées.",
    "app-encrypt-selected": "Vous avez sélectionné: $1",
    "app-encrypt-title": "Crypter l'ensemble de données",
    "app-footer-copyright": "© 2024 Digital Research Alliance of Canada",
    "app-footer-version": "FRDR Encryption Application 1.0.1",
    "app-get-entity-id-error": "Error getting user entity id on Vault. \n$1.",
    "app-get-entity-id-from-frdr-error": "Your Vault ID is not retrieved from FRDR successfully. Please go to Settings page and make sure it is set correctly on FRDR",
    "app-get-entity-name-error": "Error getting user email on Vault. \n$1.",
    "app-grant-access-button": "Accorder l'accès",
    "app-grant-access-confirm": "If you continue, you will grant $1 permission to download and decrypt $2. \n\nPlease confirm the dataset title and the requester name included here are correct before you grant access. \n\nDo you want to continue?",
    "app-grant-access-confirm-btn1": "Yes",
    "app-grant-access-confirm-btn2": "Cancel",
    "app-grant-access-dataset": "ID de l'ensemble de données",
    "app-grant-access-dataset-missing": "Please add the Dataset ID to grant access to the dataset.",
    "app-grant-access-desc": "Pour approuver une demande d'accès, ajoutez l'identifiant de l'ensemble de données et l'identifiant du demandeur figurant dans le courriel que vous avez reçu à ce sujet. Cliquez ensuite sur « Accorder l'accès », puis revenez au DFDR pour terminer l'approbation de la demande.",
    "app-grant-access-done": "Access Granted",
    "app-grant-access-done-text": "You have successfully granted access to the decryption key for this dataset. Please return to FRDR to complete the approval process by digitally signing the data access agreement.",
    "app-grant-access-done-title": "Access Granted",
    "app-grant-access-error": "Error granting access. $1",
    "app-grant-access-expire": "Date d'expiration de l'accès",
    "app-grant-access-expire-tooltip": "Votre approbation est limitée dans le temps. Le demandeur doit télécharger et déchiffrer les données avant le $1.",
    "app-grant-access-find-dataset-error": "Error finding the dataset in FRDR. Please ensure the Dataset ID you included on the Grant Access page is correct. You can find the Dataset ID in the access request email sent by FRDR. \n$1.",
    "app-grant-access-find-user-error": "Error finding the user in Vault. Please ensure the Requester ID you included on the Grant Access page is correct. You can find the Requester ID in the access request email sent by FRDR. \n$1.",
    "app-grant-access-requester": "ID du demandeur",
    "app-grant-access-requester-missing": "Please add the Requester ID of the applicant to grant access to the dataset.",
    "app-grant-access-title": "Accorder l'accès",
    "app-login-frdr-btn": "Connexion avec Globus",
    "app-login-frdr-desc": "Cliquez sur le bouton ci-dessous pour vous connecter à un compte du DFDR existant ou pour en créer un nouveau. DFDR utilise Globus Auth pour gérer la connexion.",
    "app-login-frdr-error": "Error logging into FRDR. \n$1",
    "app-login-frdr-success-message": "Your authentication to FRDR was successful. Kindly return to the FRDR Encryption Application and click on \"Log in with Globus\" again. In this second step, you will be authenticating to access FRDR's instance of Vault, where your encryption keys will be managed. You may close this tab now.",
    "app-login-frdr-title": "Étape 1 de 2 de la connexion",
    "app-login-url-tooltip": "If running for development, probably http://127.0.0.1:8200.",
    "app-login-vault-btn": "Connexion avec Globus",
    "app-login-vault-desc": "Cliquez à nouveau sur « Connexion avec Globus » pour vous connecter à l'instance Vault de DFDR, où vos clés de chiffrement seront gérées.<br><br>Si c'est la première fois que vous vous connectez à l'instance Vault du DFDR, vous devrez autoriser frdrvault.net à consulter l'identité Globus et l'adresse courriel associées à votre compte du DFDR.",
    "app-login-vault-desc2": "",
    "app-login-vault-error": "Error logging into Vault with Globus OAuth. \n$1",
    "app-login-vault-local-keys-error-text": "You are not able to use FRDR Encryption Application on this device",
    "app-login-vault-local-keys-error-title": "Error with local public and private key pair",
    "app-login-vault-success-message": "Your authentication to Vault was successful, you may close this tab now.",
    "app-login-vault-title": "Étape 2 de 2 de la connexion",
    "app-logout": "Vous vous êtes déconnecté avec succès.",
    "app-logout-error": "Error logging out. \n$1",
    "app-name": "Application de chiffrement du DFDR",
    "app-navbar-account": "Compte",
    "app-navbar-account-logout": "Déconnexion",
    "app-navbar-account-profile": "Profil",
    "app-navbar-contact-us": "Contactez nous",
    "app-navbar-decrypt": "Décrypter l'ensemble de données",
    "app-navbar-encrypt": "Chiffrer l'ensemble de données",
    "app-navbar-grant-access": "Accorder l'accès",
    "app-navbar-locale": "FR",
    "app-navbar-locale-english": "Anglias",
    "app-navbar-locale-french": "Français",
    "app-profile-copied": "Copied!",
    "app-profile-copy-error": "Sorry, not copied!",
    "app-profile-copy-error-2": "Copy to clipboard: Ctrl+C or Command+C, Enter",
    "app-profile-copy-to-clipboard": "Copier dans le presse-papier",
    "app-profile-email": "Courriel :",
    "app-profile-title": "Profil de l'utilisateur",
    "app-profile-user-id": "Identifiant de l'utilisateur de Vault :",
    "app-request-access-button": "Show Vault ID",
    "app-request-access-confirm-btn": "Copy to Clipboard",
    "app-request-access-confirm-msg": "Please copy the following id to the Requester ID Field on the Access Request Page on FRDR.",
    "app-request-access-done-msg": "Requester ID copied to clipboard",
    "app-request-access-error": "Error generating access request. \n$1.",
    "app-request-access-intro1": "Votre identifiant de utilisateur Vault est unique à votre compte du DFDR. Il est nécessaire pour accéder aux ensembles de données à usage restreint dans DFDR et sera prérempli dans chaque demande d'accès que vous soumettrez. <br><br>Cet identifiant a été automatiquement envoyé à DFDR et figure sous « Données sensibles » sur la page ",
    "app-request-access-intro2": " de votre compte. Si vous constatez que votre identifiant de Vault n'est pas enregistré dans vos paramètres DFDR, veuillez contacter l'assistance à l'adresse courriel <a href=mailto:support@frdr-dfdr.ca>support@frdr-dfdr.ca</a>.",
    "app-request-access-ok-btn": "OK",
    "app-request-access-profile": "Paramètres",
    "app-request-access-title": "Show Vault ID",
    "app-send-entity-id-to-frdr-error": "Your Vault User ID has not been sent to FRDR successfully. Please contact support@frdr-dfdr.ca for help."
}
