{
    "@metadata": {
        "authors": [
            "Digital Research Alliance of Canada <support@frdr.ca> (https://www.frdr-dfdr.ca)"
        ],
        "last-updated": "2025-12-11",
        "locale": "fr"
    },
    "app-cancel-btn": "Annuler",
    "app-decrypt-button": "Déchiffrer les données",
    "app-decrypt-confirm": "Vous tentez de déchiffrer le jeu de données $1. \n\nVeuillez poursuivre uniquement si vous utilisez un ordinateur sécurisé et approuvé par votre établissement.\n\nVoulez-vous continuer ?",
    "app-decrypt-confirm-btn1": "Oui",
    "app-decrypt-confirm-btn2": "Annuler",
    "app-decrypt-desc": "Pour déchiffrer un ensemble de données chiffrées téléchargé depuis DFDR, vous devez copier-coller l'URL de la clé de vault figurant dans le courriel d'approbation de votre demande d'accès.",
    "app-decrypt-done": "Le jeu de données a été déchiffré.",
    "app-decrypt-error": "Erreur lors du déchiffrement. $1",
    "app-decrypt-in-progress": "Déchiffrement du jeu de données...",
    "app-decrypt-input": "Chemin d'accès à l'ensemble chiffré",
    "app-decrypt-input-missing": "Veuillez sélectionner le paquet chiffré que vous souhaitez déchiffrer. Il s’agit du progiciel de données chiffrées que vous avez téléchargé depuis le DFDR.",
    "app-decrypt-input-select": "Sélectionnez un fichier",
    "app-decrypt-input-tooltip": "Sélectionnez ensuite l'ensemble chiffré que vous souhaitez déchiffrer.",
    "app-decrypt-no-selection": "No Selection",
    "app-decrypt-output": "Dossier de sortie",
    "app-decrypt-output-missing": "Veuillez sélectionner un emplacement pour le jeu de données déchiffré.",
    "app-decrypt-output-select": "Sélectionnez le répertoire",
    "app-decrypt-output-tooltip": "Veuillez vous assurer que l'emplacement sélectionné est sécurisé et adapté au stockage de fichiers à usage restreint.",
    "app-decrypt-selected": "Selected: $1",
    "app-decrypt-title": "Déchiffrer l'ensemble de données",
    "app-decrypt-url": "URL de la clé de vault",
    "app-decrypt-url-missing": "Veuillez ajouter l’URL de clé Vault qui figure dans le courriel confirmant l’approbation de votre demande d’accès.",
    "app-desc": "Bienvenue dans l'application de chiffrement du DFDR. Vous pouvez utiliser l'application pour crypter, déchiffrer et partager l'accès à des ensembles de données sensibles avec Le Dépôt fédéré de données de recherche.",
    "app-desc-homepage": "Bienvenue dans l'application de chiffrement du DFDR. Veuillez sélectionner l'une des options du menu ci-dessus pour commencer. <br><br>Si vous devez déposer des données à usage restreint dans DFDR, cliquez sur « Chiffrer l'ensemble de données » puis suivez les étapes pour créer un paquet de données chiffrées à déposer. Une fois votre ensemble de données publié, vous pouvez gérer les personnes ayant accès à vos fichiers à l'aide de l'option « Accorder l'accès » ci-dessus. <br><br>Si vous avez demandé l'autorisation d'accéder à des fichiers de données à usage restreint dans DFDR et que votre demande a été approuvée, cliquez sur « dechiffrer l'ensemble de données » et suivez les étapes pour extraire le contenu du paquet de données chiffrées que vous avez téléchargé depuis DFDR.",
    "app-encrypt-button": "Chiffrer les données",
    "app-encrypt-cancel-button": "Arrêter le chiffrement",
    "app-encrypt-cancel-error": "Échec de l’arrêt du chiffrement. $1",
    "app-encrypt-confirm": "Une fois votre jeu de données chiffré, vous NE POUVEZ PLUS ajouter ni modifier de fichiers. Veuillez vous assurer que le jeu de données est COMPLET avant de le chiffrer.",
    "app-encrypt-confirm-btn1": "Chiffrer",
    "app-encrypt-confirm-btn2": "Annuler",
    "app-encrypt-done": "Votre paquet de données chiffré a été créé à l’emplacement suivant : $1",
    "app-encrypt-done-text1": "Votre jeu de données a été chiffré. Veuillez retourner dans le DFDR pour téléverser le paquet de données chiffré dans votre dépôt. Il doit être ajouté au répertoire « sensible » dans l’onglet « Transférer des données » de l’interface de dépôt.",
    "app-encrypt-done-text2": "Tableau de bord des publications du DFDR",
    "app-encrypt-done-title": "Chiffrement terminé",
    "app-encrypt-error": "Erreur lors du chiffrement. $1",
    "app-encrypt-in-progress": "Chiffrement du jeu de données...",
    "app-encrypt-info": "Pour déposer des données à accès restreint sur DFDR, vous devez donc créer un paquet crypté. Chaque dépôt ne peut contenir qu'un seul paquet crypté. Placez les fichiers que vous souhaitez déposer dans un dossier de niveau supérieur et assurez-vous qu'ils ne sont pas compressés (c'est-à-dire qu'il ne s'agit pas de fichiers .zip ou .gz).",
    "app-encrypt-input": "Dossier de l'ensamble des données",
    "app-encrypt-input-missing": "Veuillez sélectionner le répertoire contenant l'ensemble de données que vous souhaitez chiffrer.",
    "app-encrypt-input-select": "Sélectionnez le répertoire",
    "app-encrypt-input-tooltip": "Sélectionnez le dossier de niveau supérieur qui contient le ou les fichiers de données que vous souhaitez chiffrer.",
    "app-encrypt-output": "Dossier de sortie",
    "app-encrypt-output-missing": "Veuillez sélectionner l’emplacement de sortie de votre paquet chiffré.",
    "app-encrypt-output-select": "Sélectionnez le répertoire",
    "app-encrypt-output-tooltip": "Choisissez un emplacement sur votre ordinateur local ou votre serveur pour enregistrer le paquet de données chiffrées.",
    "app-encrypt-selected": "Vous avez sélectionné: $1",
    "app-encrypt-title": "Crypter l'ensemble de données",
    "app-footer-copyright": "© 2024 Digital Research Alliance of Canada",
    "app-footer-version": "FRDR Encryption Application 1.0.1",
    "app-get-entity-id-error": "Erreur lors de la récupération de l’identifiant d’entité utilisateur dans Vault.\n$1.",
    "app-get-entity-id-from-frdr-error": "Votre identifiant Vault n’a pas été récupéré correctement depuis le DFDR. Veuillez retourner à la page Paramètres et vous assurer que celui-ci est correctement configuré dans le DFDR.",
    "app-get-entity-name-error": "Erreur lors de la récupération du courriel de l’utilisateur dans Vault.\n$1.",
    "app-grant-access-button": "Accorder l'accès",
    "app-grant-access-confirm": "Si vous poursuivez, vous accorderez à $1 l’autorisation de télécharger et de déchiffrer $2. \n\nVeuillez confirmer que le titre du jeu de données et le nom du demandeur indiqués ici sont exacts. \n\nVoulez-vous continuer ?",
    "app-grant-access-confirm-btn1": "Oui",
    "app-grant-access-confirm-btn2": "Annuler",
    "app-grant-access-dataset": "ID de l'ensemble de données",
    "app-grant-access-dataset-missing": "Veuillez ajouter l’identifiant du jeu de données pour accorder l’accès au jeu de données.",
    "app-grant-access-desc": "Pour approuver une demande d'accès, ajoutez l'identifiant de l'ensemble de données et l'identifiant du demandeur figurant dans le courriel que vous avez reçu à ce sujet. Cliquez ensuite sur « Accorder l'accès », puis revenez au DFDR pour terminer l'approbation de la demande.",
    "app-grant-access-done": "Accès accordé",
    "app-grant-access-done-text": "Vous avez accordé avec succès l’accès à la clé de déchiffrement de ce jeu de données. Veuillez retourner dans le DFDR pour compléter le processus d’approbation en signant électroniquement l’entente d’accès aux données.",
    "app-grant-access-done-title": "Accès accordé",
    "app-grant-access-error": "Erreur lors de l’octroi de l’accès. $1",
    "app-grant-access-expire": "Date d'expiration de l'accès",
    "app-grant-access-expire-tooltip": "Votre approbation est limitée dans le temps. Le demandeur doit télécharger et déchiffrer les données avant le $1.",
    "app-grant-access-find-dataset-error": "Erreur lors de la recherche du jeu de données dans le DFDR. Veuillez vous assurer que l’identifiant du jeu de données indiqué sur la page « Accorder l’accès » est exact. Vous trouverez l’identifiant du jeu de données dans le courriel de demande d’accès envoyé par la DFDR. \n$1.",
    "app-grant-access-find-user-error": "Erreur lors de la recherche de l’utilisateur dans Vault. Veuillez vous assurer que l’identifiant du demandeur indiqué sur la page « Accorder l’accès » est exact. Vous trouverez l’identifiant du demandeur dans le courriel de demande d’accès envoyé par le DFDR.\n$1.",
    "app-grant-access-requester": "ID du demandeur",
    "app-grant-access-requester-missing": "Veuillez ajouter l’identifiant du demandeur pour accorder l’accès au jeu de données.",
    "app-grant-access-title": "Accorder l'accès",
    "app-login-frdr-btn": "Connexion avec Globus",
    "app-login-frdr-desc": "Cliquez sur le bouton ci-dessous pour vous connecter à un compte du DFDR existant ou pour en créer un nouveau. DFDR utilise Globus Auth pour gérer la connexion.",
    "app-login-frdr-error": "Erreur lors de la connexion au DFDR. \n$1",
    "app-login-frdr-success-message": "Votre authentification au DFDR a réussi. Veuillez retourner à l’application de chiffrement du DFDR et cliquer de nouveau sur « Ouvrir une session avec Globus ». Lors de cette deuxième étape, vous vous authentifierez pour accéder à l’instance Vault de la DFDR, où vos clés de chiffrement seront gérées. Vous pouvez fermer cet onglet maintenant.",
    "app-login-frdr-title": "Étape 1 de 2 de la connexion",
    "app-login-url-tooltip": "En environnement de développement, il s’agit probablement de http://127.0.0.1:8200.",
    "app-login-vault-btn": "Connexion avec Globus",
    "app-login-vault-desc": "Cliquez à nouveau sur « Connexion avec Globus » pour vous connecter à l'instance Vault de DFDR, où vos clés de chiffrement seront gérées.<br><br>Si c'est la première fois que vous vous connectez à l'instance Vault du DFDR, vous devrez autoriser frdrvault.net à consulter l'identité Globus et l'adresse courriel associées à votre compte du DFDR.",
    "app-login-vault-desc2": "",
    "app-login-vault-error": "Erreur lors de la connexion à Vault avec OAuth Globus. \n$1",
    "app-login-vault-local-keys-error-text": "Vous ne pouvez pas utiliser l’application de chiffrement du DFDR sur cet appareil",
    "app-login-vault-local-keys-error-title": "Erreur avec la paire de clés publique et privée locale",
    "app-login-vault-success-message": "Votre authentification à Vault a réussi. Vous pouvez fermer cet onglet maintenant.",
    "app-login-vault-title": "Étape 2 de 2 de la connexion",
    "app-logout": "Vous vous êtes déconnecté avec succès.",
    "app-logout-error": "Error logging out. \n$1",
    "app-name": "Application de chiffrement du DFDR",
    "app-navbar-account": "Compte",
    "app-navbar-account-logout": "Déconnexion",
    "app-navbar-account-profile": "Profil",
    "app-navbar-contact-us": "Contactez nous",
    "app-navbar-decrypt": "Décrypter l'ensemble de données",
    "app-navbar-encrypt": "Chiffrer l'ensemble de données",
    "app-navbar-grant-access": "Accorder l'accès",
    "app-navbar-locale": "FR",
    "app-navbar-locale-english": "Anglias",
    "app-navbar-locale-french": "Français",
    "app-profile-copied": "Copied!",
    "app-profile-copy-error": "Sorry, not copied!",
    "app-profile-copy-error-2": "Copy to clipboard: Ctrl+C or Command+C, Enter",
    "app-profile-copy-to-clipboard": "Copier dans le presse-papier",
    "app-profile-email": "Courriel :",
    "app-profile-title": "Profil de l'utilisateur",
    "app-profile-user-id": "Identifiant de l'utilisateur de Vault :",
    "app-request-access-button": "Show Vault ID",
    "app-request-access-confirm-btn": "Copy to Clipboard",
    "app-request-access-confirm-msg": "Please copy the following id to the Requester ID Field on the Access Request Page on FRDR.",
    "app-request-access-done-msg": "Requester ID copied to clipboard",
    "app-request-access-error": "Error generating access request. \n$1.",
    "app-request-access-intro1": "Votre identifiant de utilisateur Vault est unique à votre compte du DFDR. Il est nécessaire pour accéder aux ensembles de données à usage restreint dans DFDR et sera prérempli dans chaque demande d'accès que vous soumettrez. <br><br>Cet identifiant a été automatiquement envoyé à DFDR et figure sous « Données sensibles » sur la page ",
    "app-request-access-intro2": " de votre compte. Si vous constatez que votre identifiant de Vault n'est pas enregistré dans vos paramètres DFDR, veuillez contacter l'assistance à l'adresse courriel <a href=mailto:support@frdr-dfdr.ca>support@frdr-dfdr.ca</a>.",
    "app-request-access-ok-btn": "OK",
    "app-request-access-profile": "Paramètres",
    "app-request-access-title": "Show Vault ID",
    "app-send-entity-id-to-frdr-error": "Your Vault User ID has not been sent to FRDR successfully. Please contact support@frdr-dfdr.ca for help."
}
